# GetSizeInShortInts Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IndexPoint..::..GetSizeInShortInts Method
IndexPoint Class See Also
---
Gets the amount of storage that the primitive takes up in a buffer, measured in short integers.
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public static int GetSizeInShortInts()
```

Visual Basic
---
```text
Public Shared Function GetSizeInShortInts As Integer
```

Visual C++
---
```text
public:
static int GetSizeInShortInts()
```

# ### Return Value
The number of short integers occupied by the primitive.
# See Also
IndexPoint Class
Autodesk.Revit.DB.DirectContext3D Namespace